# SetVoltageValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageType..::..SetVoltageValue Method
VoltageType Class See Also
---
Assign new values to modify voltage type, all of the unit are volt.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetVoltageValue(
	double actualValue,
	double minValue,
	double maxValue
)
```

Visual Basic
---
```text
Public Sub SetVoltageValue ( _
	actualValue As Double, _
	minValue As Double, _
	maxValue As Double _
)
```

Visual C++
---
```text
public:
void SetVoltageValue(
	double actualValue,
	double minValue,
	double maxValue
)
```

# ### Parameters
actualValue
    Type: System..::..Double
minValue
    Type: System..::..Double
maxValue
    Type: System..::..Double
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Actual value can't be more than minValue or less than maxValue, and all of them can't be negative, otherwise the exception will be thrown. |

# See Also
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace